//1. Создацте объект с днями недели. Ключами в нем должны служить номера дней от начала недели
//(понедельник - первый и т.д.). Пусть номер дня недели хранится в переменной day, например, 
//там лежит число 3. Выведите день недели, соответствующий значению переменной day.day
let week ={
    1: 'понедельник',
    2:'вторник',
    3:'среда',
    4:'четверг',
    5:'пятница',
    6:'суббота',
    7:'воскресенье',
};
let day = 3;
console.log(week[day]);

//2. Дан объект {js:['jQuery', 'Angular'], php: 'hello', css:'world'}. 
//Выведите с его помощью слово 'jQuery'
let Object ={
    js: ['jQuery', 'Angular'],
    php: 'hello',
    css: 'world',
};
let{js:[ js1, js2], php, css} = Object;
console.log(js1);
//3. Создайте массив d4 с числовыми велечинами 45, 78, 10, 3. Напишите функцию сортировки my(a,b),
//которая при вызове d4.sort(my) отсортирует элементы массива по убыванию чисел. Вызовите d4.sort(my)
let d4 = [45, 78, 10, 3];
function my(a,b){
    return b-a
};
console.log(d4.sort(my));