//1. Дан массив. Запишите первый элемент этого массива в переменную elem1,
// второй в пееременную elem2, 3 - elem3, а все остальные элементы массива - в переменную arr)
let array = [1,2,3,4,5,6,7,8,9,9,10];
let [elem1, elem2, elem3, ...arr] = array;
console.log(elem1);
//2.Дан объект {name: 'Петр', 'surname':'Петров', 'age': '20 лет'}. Запишите соответствующие
//значения в переменные name, surname и age. Сделайте так, чтобы , если какое-то значение не задано,
// оно принимало следующее значение по умолчанию {name: 'Аноним', 'surname':'Анонимович', 'age': '? лет'}
let Object = {
    name: 'Петр',
    surname:'Петров',
    age: '20 лет',
};
let {name = 'Аноним', surname = 'Анонимович', age = '? лет'} = Object;
console.log(name, surname, age);