//1. Создать функцию, которая принимает массив, а возвращает новый массив
//с дублированными элементами входного массива.
function doubleArray(Array){
    return ([...Array, ...Array]);
}
console.log(doubleArray([1,2,3]));
//2.Напишите код, который преобразовывает и объединяет все элементы массива в одно строковое значение.
//Элементы массива будут разделены запятой. Получите результат двумя разными методами.

let arr = [1, 2, 3, 4, 5];
let myArr = arr.toString();
console.log(myArr);

let newArr = [1,2,3,4,5];
console.log(newArr.join());

//3.Напишите фцнкцию removeDuplicate(arr), которая возвращает массив, в котором удалены повторяющиеся
// элементы из массива arr (игнорируйте чувствительность к регистру).
function removeDuplicates(Array){
    let uniqueArr = [...new Set(Array)];
    console.log(uniqueArr);
}
removeDuplicates([1,2,2,3]);

// 4. Напишите функцию, которая возвращает массив элементов представляющих собой сумму соответствующих 
// элементов заданных массивов.
function sumArrays (arr1, arr2, arr3, arr4){
    arr1.reduce((a, b) => a+b)
}

// 5. Напишите функцию compareNumbers(arr), которая возвращает массив, элементы которого отсортированы
// по убыванию их значений. compareNumbers([[1,2,2,3]])//[3,2,2,1]

let numbers = [1,2,2,3];
numbers.sort(function(a,b){
    return b-a;
});
console.log(numbers);

//6. Напишите функцию, которая возвращает сумму и произведение значений массива.
// sumArrays([1,2,2,3])//"8 и 12"
